[
 {
  "company": "NBCUniversal",
  "title": ["Global Client Operations Specialist", "Global Client Operations Coordinator"],
  "time": ["September 2018 - Present", "August 2017 - September 2018"],
  "duties": [["Specialize in workflows to help streamline and drive process efficiencies.","Subject Matter Expert for the DreamWorks content fulfillment as part of library migration.","Developed a process workflow for all legacy migration content from initiation of asset requests.", "Analyze data to suggest and implement process improvements to increase efficiency of project workflow through entire project lifecycle.", "Establish and document standard operating procedures to use as a training resource.","Work within the team to collaborate on innovative ideas to overcome issues and always work toward best practices for solutions."],
  ["Provide order management and client services to several internal organizations.","Act as a liaison between multiple departments to ensure a timely and accurate deliverable per order.","Research, troubleshoot, and manage each order from receipt through final client delivery.","Communicated, verbally and in writing to clients the project status, issues, and risks for each order.","Coordinate with several departments for troubleshooting of issues and QA of all assets prior to delivery to client platform."]]
  },
  {
    "company": "Starz",
    "title": ["Operations Specialist"],
    "time": ["May 2016 - November 2016"],
    "duties":[["Managed full cycle project operations including administration, auditing reporting and communication for marketing division of a Multi $Billion leading global media and entertainment company.","Improved process efficiency and overall profitability by identifying and combining duplicate asset requests from multiple internal customers.","Developed and introduced project reporting system, writing multiple complex macros reducing time to identify inefficiencies or delays in project completion.","Processed and managed 80-100 monthly complex digital media project requests, increasing project on time completion rate by auditing requests for accuracy.","Conducted weekly and periodic project update meetings with leadership and channel managers, communicated all changes and updates through various channels."]]
  },
  {
    "company": "Mastec Network Solutions",
    "title": ["Project Manager", "Site Acquisition Specialist", "Project Coordinator"],
    "time": ["December 2014 - May 2016","July 2013 - December 2014", "May 2013 - July 2013"],
    "duties": [["Promoted into Project Manager role for regional office of $1.5B national telecommunications infrastructure and engineering firm. Management of multiple wireless tower site project cycles as part of multi state installation for global telecom carrier.","Successfully managed project operations and timelines for 300+ projects ($6M) from build scoping, and timeline planning through final review and construction handoff.","Increased project profitability by auditing installations for accuracy to identify inconsistencies, missing items and overcharges.","Improved profitability of proposals / projects by conducting end of project review focusing on cost and efficiency.","Conducted regular project progress meetings / calls with clients, vendors, team members and internal team leaders and upper managers providing detailed reviews and analysis including contract requirements, financial variations and project timeline.","Managed entire financial cycle, including proposals and purchase orders and closeouts. Administered all project budgets, project financial tracking and reporting, and project close out.","Manage inspection and acceptance work performed by multiple vendors and company resources, including the quality of services, equipment and materials."],["Managed activity for leasing, jurisdictional, CD and site acquisition vendor.","Coordinated activities for the zoning and permitting for 50+ telecommunication projects, working directly with jurisdictional agencies and departments.","Conducted project status and timeline reporting to clients.","Audited 200+ sites for purchase order accuracy, reducing overbilling.","Conducted contract and purchase order reviews with vendors to reconcile billing amounts and solve billing rejections.","Administered purchase order initiation and approval process, maintaining accurate and efficient records."],["Obtained approval for and submitted requests in Oracle to obtain Purchase Orders.","Built site books containing safety information, Construction drawings, structural analysis, building permits, and other various information for all sites.","Submitted inventory tickets to client for all sites.","Maintained pass/fail status of inventory tickets on all submitted items and resubmitted as required.","Tracked and maintained status of various project items via excel spreadsheets.","Worked with PM to obtain documents as necessary to complete electrical contractor licenses with several jurisdictions."]]
  }
]